<a href="https://colab.research.google.com/github/gg5d/DS-3005/blob/main/warm_up_9_student.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Warm-up: pandas

1. Import dependencies

In [ ]:
import

---

In [ ]:
list = [98, 24, 46, 87, 33]

2. Convert `list` to a pandas series using `pd.Series`

0    98
1    24
2    46
3    87
4    33
dtype: int64

3. Take the above series and add an index that starts at 2 and steps by 3

2     98
5     24
8     46
11    87
14    33
dtype: int64

4. Create a dictionary of 4 names, ages, and careers   
Convert this dictionary to a pandas dataframe: `df`.  
Print the dataframe.

      name  age           career
0   Connor   25         engineer
1   Lauren   55     veterinarian
2  Allison   32          teacher
3     Ryan   42  product manager

5. Name the index of `df` 'participant_id'.  
Print `df`.

                   name  age           career
participant_id
0                Connor   25         engineer
1                Lauren   55     veterinarian
2               Allison   32          teacher
3                  Ryan   42  product manager

6. Use a pandas function to determine the data types of the columns of `df`.

name      object
age        int64
career    object
dtype: object

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   age     4 non-null      int64
 2   career  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

7. Using bracket notation, reference column `name`

participant_id
0     Connor
1     Lauren
2    Allison
3       Ryan
Name: name, dtype: object

8. Using dot notation, reference column `name`

participant_id
0     Connor
1     Lauren
2    Allison
3       Ryan
Name: name, dtype: object

8. Reference column `name` and have it returned in a dataframe.

                   name
participant_id
0                Connor
1                Lauren
2               Allison
3                  Ryan

9. Show the 3rd element in column `career`.

'teacher'

'teacher'

Last time we defined the dataframe df as

In [ ]:
df = pd.DataFrame({'x':[0,2,1,5], 'y':[1,1,0,0], 'z':[True,False,False,False]})

Rename the column name 'z' to 'is_label'

Create a new column, labeled 'x_plus_y', adding column 'x' and column 'y'

### Removing Columns with `del` and `.drop()`

## `del`

`del` can drop a DataFrame or single columns from the frame

In [ ]:
df_drop = df.copy()
df_drop

   x  y  is_label  x_plus_y
0  0  1      True         1
1  2  1     False         3
2  1  0     False         1
3  5  0     False         5

In [ ]:
# delete the column 'x'
del df_drop['x']

In [ ]:
df_drop

   y  is_label  x_plus_y
0  1      True         1
1  1     False         3
2  0     False         1
3  0     False         5

## `.drop()`

Can drop one or more columns/rows.

takes `axis` parameter:
- axis=0 refers to rows  
- axis=1 refers to columns

Drop columns 'x_plus_y' and 'is_label' from df.drop

In [ ]:
               # drop columns

In [ ]:
df_drop

   y
0  1
1  1
2  0
3  0

In [ ]:
df

   x  y  is_label  x_plus_y
0  0  1      True         1
1  2  1     False         3
2  1  0     False         1
3  5  0     False         5

Drop rows 0 and 2 from df_drop

   x  y  is_label  x_plus_y
1  2  1     False         3
3  5  0     False         5